{"greeting": "Greetings from The On-Line Encyclopedia of Integer Sequences! http://oeis.org/", "query": "id:A002904", "count": 1, "start": 0, "results": [{"number": 2904, "data": "0,0,0,0,4,9,5,1,1,0,55,55,1,0,1,9,5,1,1,0,0,0,0,0,4,9,5,1,1,1,1,1,1,1", "name": "Delete all letters except c, d, i, l, m, v, x from the English name of n, then read as Roman numeral if possible, otherwise 0.", "comment": ["From _M. F. Hasler_, Feb 21 2020: (Start)", "There are several standards for Roman numerals, even though experts agree that none of them has ever been universally accepted, cf. references in Wikipedia article.", "The current definition of the sequence uses \"if possible\", so whenever there is a possible interpretation according to any of these standards, it is acceptable.", "Non-uniqueness could be caused by rare irregular variants which must be excluded in order to have a well-defined sequence. E.g., iixx will mean 18, not 22, although the standard notation for 18 is xviii (and xiix would also be used sometimes).", "If required, the meaning of \"possible\" must be made more precise (e.g., allowing only \"standard subtractive\" or additionnally \"standard additive\" notation; this can be made completely explicit). (End)"], "link": ["Brady Haran and N. J. A. Sloane, <a href=\"https://www.youtube.com/watch?v=OeGSQggDkxI\">What Number Comes Next?</a> (2018), Numberphile video.", "Wikipedia, <a href=\"https://en.wikipedia.org/wiki/Roman_numerals\">Roman numerals</a>, as of Feb 19 2020"], "example": ["To get a(5), write 5 = \"five\", delete 'f' & 'e' to get \"iv\", Roman for 4 = a(5).", "To get a(35), write 35 = \"thirty five\", delete all but 'i's and 'v's, to get \"iiv\", which is not a legal Roman number*, so a(35) = 0 by definition of the sequence. (*It is never allowed to subtract more than one unit 'I' (or 'X' or 'C') from one of the symbols V, L, D representing 5 times a power of 10, as it is never allowed that one of V, L, D is subtracted from one of I, X, C, M.)"], "xref": ["See A092302 and A121305 for other versions."], "keyword": "nonn,word", "offset": "1,5", "author": "_J. H. Conway_", "references": 4, "revision": 29, "time": "2020-02-25T22:37:22-05:00", "created": "1991-04-30T03:00:00-04:00"}]}