{"greeting": "Greetings from The On-Line Encyclopedia of Integer Sequences! http://oeis.org/", "query": "id:A006747", "count": 1, "start": 0, "results": [{"number": 6747, "id": "M3741", "data": "0,0,0,1,1,5,4,18,19,73,73,278,283,1076,1090,4125,4183,15939,16105,61628,62170,239388,240907,932230,936447,3641945,3651618,14262540", "name": "Number of rotationally symmetric polyominoes with n cells (that is, polyominoes with exactly the symmetry group C_2 generated by a 180 degree rotation).", "comment": ["This sequence gives the number of free polyominoes with symmetry group \"R\", in Redelmeier's notation. See his Tables 1 and 3, also the column \"Rot\" in Oliveira e Silva's table."], "reference": ["S. W. Golomb, Polyominoes, Princeton Univ. Press, NJ, 1994.", "N. J. A. Sloane and Simon Plouffe, The Encyclopedia of Integer Sequences, Academic Press, 1995 (includes this sequence)."], "link": ["Tomás Oliveira e Silva, <a href=\"http://sweet.ua.pt/tos/animals.html\">Enumeration of polyominoes</a>", "Tomás Oliveira e Silva, <a href=\"/A006747/a006747.png\">Numbers of polyominoes classified according to Redelmeier's symmetry classes</a> (an extract from the previous link)", "D. H. Redelmeier, <a href=\"http://dx.doi.org/10.1016/0012-365X(81)90237-5\">Counting polyominoes: yet another attack</a>, Discrete Math., 36 (1981), 191-203.", "D. H. Redelmeier, <a href=\"/A056877/a056877.png\">Table 3</a> of Counting polyominoes..."], "example": ["a(2) = 0 because the \"domino\" polyomino has symmetry group of order 4.", "For n=3, the three-celled polyomino [ | | ] has group of order 4, and the polyomino", ". [ ]", ". [ | ]", "has only reflective symmetry, so a(3) = 0.", "a(4) = 1 because of (in Golomb's notation) the \"skew tetrominoe\"."], "xref": ["Cf. A000105, A001168, A006746, A056877, A006748, A056878, A006747, A006749.", "Sequences classifying polyominoes by symmetry group: A000105, A006746, A006747, A006748, A006749, A056877, A056878, A142886, A144553, A144554."], "keyword": "nonn", "offset": "1,6", "author": "_N. J. A. Sloane_", "ext": ["Extended to n=28 by Tomás Oliveira e Silva", "a(1)-a(3) prepended by _Andrew Howroyd_, Dec 04 2018", "Edited by _N. J. A. Sloane_, Nov 28 2020"], "references": 20, "revision": 36, "time": "2020-11-28T12:52:53-05:00", "created": "1991-07-25T03:00:00-04:00"}]}