{"greeting": "Greetings from The On-Line Encyclopedia of Integer Sequences! http://oeis.org/", "query": "id:A072796", "count": 1, "start": 0, "results": [{"number": 72796, "data": "0,1,2,3,4,6,5,7,8,9,10,14,16,19,11,15,12,17,18,13,20,21,22,23,24,25,26,27,37,38,42,44,47,51,53,56,60,28,29,39,43,52,30,40,31,45,46,32,48,49,50,33,41,34,54,55,35,57,58,59,36,61,62,63,64,65,66,67,68,69,70,71", "name": "Self-inverse permutation of natural numbers induced by Catalan Automorphism *A072796 acting on the parenthesizations encoded by A014486.", "comment": ["This automorphism effects the following transformation on the unlabeled rooted plane binary trees (letters A, B, C refer to arbitrary subtrees located on those nodes and () stands for an implied terminal node.)", "...B...C...........A...C", "....\\./.............\\./", ".A...x....-->....B...x.................A..().........A...()..", "..\\./.............\\./...................\\./....-->....\\./...", "...x...............x.....................x.............x....", "(a . (b . c)) -> (b . (a . c)) ______ (a . ()) ---> (a . ())", "In terms of general trees, it swaps the two leftmost branches of the tree if its degree (i.e. of the root) > 1 and keeps the tree intact if it is planted (root's degree = 1).", "Note that the first clause corresponds to what is called \"generator pi_0\" in Thompson's group V. (See also A074679, A089851 and A154121 for other related generators).", "Look at the example in A069770 to see how this will produce the given sequence of integers."], "reference": ["J. W. Cannon, W. J. Floyd and W. R. Parry, Introductory notes on Richard Thompson's groups, L'Enseignement Mathematique, Vol. 42 (1996), pp. 215--256."], "link": ["A. Karttunen, <a href=\"/A072796/b072796.txt\">Table of n, a(n) for n = 0..196</a>", "J. W. Cannon, W. J. Floyd and W. R. Parry, <a href=\"http://www.geom.uiuc.edu/docs/preprints/lib/GCG63/thompson.ps\">Notes on Richard Thompson's Groups F and T</a>", "A. Karttunen, <a href=\"http://oeis.org/wiki/Catalan_Automorphisms\">Catalan Automorphisms</a>"], "program": ["(Scheme function implementing this automorphism on list-structures, both the constructive (*A072796) and destructive (*A072796!) variant given:)", "(define (*A072796 s) (cond ((not (pair? s)) s) ((not (pair? (cdr s))) s) (else (cons (cadr s) (cons (car s) (cddr s))))))", "(define (*A072796! s) (cond ((not (pair? s)) s) ((not (pair? (cdr s))) s) (else (swap! s) (robr! s) (swap! (cdr s)) s)))", "(define (robr! s) (let ((ex-cdr (cdr s))) (set-cdr! s (caar s)) (set-car! (car s) ex-cdr) (swap! (car s)) (swap! s) s))", "(define (swap! s) (let ((ex-car (car s))) (set-car! s (cdr s)) (set-cdr! s ex-car) s))"], "xref": ["Row 2 of A089840. Row 3613 of A122203 and row 3617 of A122204.", "Fixed point counts and cycle counts are given in A073190 and A073191.", "Cf. A073190, A072797, A129608."], "keyword": "nonn", "offset": "0,3", "author": "_Antti Karttunen_, Jun 12 2002", "references": 50, "revision": 10, "time": "2012-06-27T13:49:49-04:00", "created": "2003-05-16T03:00:00-04:00"}]}