{"greeting": "Greetings from The On-Line Encyclopedia of Integer Sequences! http://oeis.org/", "query": "id:A072507", "count": 1, "start": 0, "results": [{"number": 72507, "data": "1,2,0,0,0,0,0,0,0,0,0", "name": "Smallest start of n consecutive integers with n divisors, or 0 if no such number exists.", "comment": ["a(3) = 0 because only squares of primes have three divisors.", "From _T. D. Noe_: (Start)", "\"Note that a(n)=0 for odd n > 1 because a number has an odd number of divisors only if it is a square and there are no consecutive positive squares. Also, a(4)=0 because one of four consecutive numbers would be a multiple of 4 and have 4 divisors only if it is 8.", "\"Similarly, a(6)=0 because one of six consecutive number would be a multiple of 6 and the only multiples of 6 having 6 divisors are 12 and 18. For a(8), one of the eight consecutive numbers must be an odd multiple of 4, which cannot have 8 divisors. Interestingly, the 7 consecutive numbers starting at 171893 have 8 divisors.", "\"Similarly, for a(10), one of the ten consecutive numbers must be an odd multiple of 4, which would have 3x divisors. It is also easy to verify that a(n)=0 for n=14,16,20,22,26,28,32,34,... It seems likely that a(n)=0 for n>2.\"  (End)", "This sequence is zero for all but finitely many n. If k = floor(log_2(n)), there must be at least one term exactly divisible by 2^j for any j < k; hence the number of divisors must be divisible by j+1, or more generally by lcm_{i<=k} i. The only values of n divisible by this lcm are 1,2,3,4,6,12,24,60 and 120. For example, for n=30, there must be an element divisible by exactly 8, so its number of divisors is divisible by 4. For n = 60, there must by two numbers 8k and 8(k+2) with k odd; then k and k+2 must each have 15 divisors, making them squares. Together with the comments from _T. D. Noe_, this leaves only 12, 24 and 120 as open questions. - _Franklin T. Adams-Watters_, Jul 14 2006", "As _Vladimir Letsko_ pointed out on Jul 07 2017 at A119479, 99949636937406199604777509122843 starts a run of 13 consecutive integers each having 12 divisors. - _Jon E. Schoenfield_, Sep 20 2017"], "reference": ["R. K. Guy, Unsolved Problems in Theory of Numbers, Springer-Verlag, Third Edition, 2004, B12."], "example": ["a(2) = 2 as 2 and 3 are the first (by chance the only) set of two consecutive integers with two divisors."], "xref": ["Cf. A000005 (number of divisors of n).", "Cf. A006558 (start of first run of n consecutive integers with same number of divisors).", "Cf. A119479."], "keyword": "more,nonn", "offset": "1,2", "author": "_Amarnath Murthy_, Jul 22 2002", "ext": ["More terms from _T. D. Noe_, Dec 04 2004"], "references": 3, "revision": 20, "time": "2018-09-21T02:12:17-04:00", "created": "2003-05-16T03:00:00-04:00"}]}