{"greeting": "Greetings from The On-Line Encyclopedia of Integer Sequences! http://oeis.org/", "query": "id:A108067", "count": 1, "start": 0, "results": [{"number": 108067, "data": "8,8000000000,8000000008,8000000018,8018000000,8018000008,8018000018,8018018000,8018018008,8018018018,8018018800,8018018808,8018018818,8018018880,8018018888,8018018885,8018018884,8018018889,8018018881,8018018887,8018018886,8018018883,8018018882,8018018811,8018018815,8018018850", "name": "Integers in alphabetical order in U.S. English (another version of A004740).", "comment": ["The last term of this infinite sequence is 0. - _Lekraj Beedassy_, Mar 09 2006", "The penultimate term using the accepted naming convention would be TWO VIGINITILLION TWO UNDECILLION TWO TRILLION TWO THOUSAND TWO HUNDRED TWO. Because not all numbers have names, the sequence would not truly be infinite. [Matthew Goers, Jan 11 2012]", "The sequence does not count spaces and hyphens when alphabetizing. If spaces were counted, eight billion eight million would be after eight billion eight. - _Charles Coker_, Jul 29 2019"], "example": ["EIGHT", "EIGHT BILLION", "EIGHT BILLION EIGHT", "EIGHT BILLION EIGHTEEN", "EIGHT BILLION EIGHTEEN MILLION", "EIGHT BILLION EIGHTEEN MILLION EIGHT", "EIGHT BILLION EIGHTEEN MILLION EIGHTEEN", "EIGHT BILLION EIGHTEEN MILLION EIGHTEEN THOUSAND", "EIGHT BILLION EIGHTEEN MILLION EIGHTEEN THOUSAND EIGHT", "EIGHT BILLION EIGHTEEN MILLION EIGHTEEN THOUSAND EIGHTEEN", "EIGHT BILLION EIGHTEEN MILLION EIGHTEEN THOUSAND EIGHT HUNDRED", "EIGHT BILLION EIGHTEEN MILLION EIGHTEEN THOUSAND EIGHT HUNDRED EIGHT", "EIGHT BILLION EIGHTEEN MILLION EIGHTEEN THOUSAND EIGHT HUNDRED EIGHTEEN", "EIGHT BILLION EIGHTEEN MILLION EIGHTEEN THOUSAND EIGHT HUNDRED EIGHTY", "EIGHT BILLION EIGHTEEN MILLION EIGHTEEN THOUSAND EIGHT HUNDRED EIGHTY-EIGHT", "EIGHT BILLION EIGHTEEN MILLION EIGHTEEN THOUSAND EIGHT HUNDRED EIGHTY-FIVE", "EIGHT BILLION EIGHTEEN MILLION EIGHTEEN THOUSAND EIGHT HUNDRED EIGHTY-FOUR", "EIGHT BILLION EIGHTEEN MILLION EIGHTEEN THOUSAND EIGHT HUNDRED EIGHTY-NINE", "EIGHT BILLION EIGHTEEN MILLION EIGHTEEN THOUSAND EIGHT HUNDRED EIGHTY-ONE", "EIGHT BILLION EIGHTEEN MILLION EIGHTEEN THOUSAND EIGHT HUNDRED EIGHTY-SEVEN", "EIGHT BILLION EIGHTEEN MILLION EIGHTEEN THOUSAND EIGHT HUNDRED EIGHTY-SIX", "EIGHT BILLION EIGHTEEN MILLION EIGHTEEN THOUSAND EIGHT HUNDRED EIGHTY-THREE", "EIGHT BILLION EIGHTEEN MILLION EIGHTEEN THOUSAND EIGHT HUNDRED EIGHTY-TWO", "EIGHT BILLION EIGHTEEN MILLION EIGHTEEN THOUSAND EIGHT HUNDRED ELEVEN", "EIGHT BILLION EIGHTEEN MILLION EIGHTEEN THOUSAND EIGHT HUNDRED FIFTEEN", "EIGHT BILLION EIGHTEEN MILLION EIGHTEEN THOUSAND EIGHT HUNDRED FIFTY"], "xref": ["Cf. A004740."], "keyword": "nonn,word", "offset": "1,1", "author": "_Lekraj Beedassy_, May 31 2005", "ext": ["Corrections and additions from Matthew Goers, Nov 02, 2009", "Added 8018018811 and 8018018815 proper place. Corrected 801808818. Matthew Goers, Mar 22 2012"], "references": 5, "revision": 29, "time": "2019-07-29T11:59:29-04:00", "created": "2005-07-19T03:00:00-04:00"}]}