{"greeting": "Greetings from The On-Line Encyclopedia of Integer Sequences! http://oeis.org/", "query": "id:A118278", "count": 1, "start": 0, "results": [{"number": 118278, "data": "0,-1,33066,146858,273118,-1,1274522,2117145,3613278,-1,7250758,-1,12911636,-1,22655394,26801303,25049533,-1,56922533,115715602,81539010,-1,85105105,-1,106555658,-1,233296317,267370631,286763923,-1,358322750", "name": "Conjectured largest number that is not the sum of three n-gonal numbers, or -1 if there is no largest number.", "comment": ["Extensive calculations show that if a(n) >= 0, then every number greater than a(n) can be represented as the sum of three n-gonal numbers. a(3)=0 because every number can be written as the sum of three triangular numbers. When n is a multiple of 4, there is an infinite set of numbers not representable. For n=14, there appears to be a sparse, but infinite, set of numbers not representable."], "link": ["R. K. Guy, <a href=\"http://www.jstor.org/stable/2324367\">Every number is expressible as the sum of how many polygonal numbers?</a>, Amer. Math. Monthly 101 (1994), 169-172.", "Eric Weisstein's World of Mathematics, <a href=\"http://mathworld.wolfram.com/PolygonalNumber.html\">MathWorld: Polygonal Number</a>"], "xref": ["Cf. A118279 (number of numbers not representable).", "Cf. A003679 (not the sum of three pentagonal numbers).", "Cf. A007536 (not the sum of three hexagonal numbers).", "Cf. A213523 (not the sum of three heptagonal numbers).", "Cf. A213524 (not the sum of three octagonal numbers).", "Cf. A213525 (not the sum of three 9-gonal numbers).", "Cf. A214419 (not the sum of three 10-gonal numbers).", "Cf. A214420 (not the sum of three 11-gonal numbers).", "Cf. A214421 (not the sum of three 12-gonal numbers)."], "keyword": "sign", "offset": "3,3", "author": "_T. D. Noe_, Apr 21 2006", "ext": ["a(22)-a(33) from _Donovan Johnson_, Apr 17 2010"], "references": 16, "revision": 16, "time": "2017-10-04T13:50:34-04:00", "created": "2006-02-24T03:00:00-05:00"}]}