{"greeting": "Greetings from The On-Line Encyclopedia of Integer Sequences! http://oeis.org/", "query": "id:A122200", "count": 1, "start": 0, "results": [{"number": 122200, "data": "0,1,0,2,1,0,3,2,1,0,4,3,2,1,0,5,4,3,2,1,0,6,5,4,3,2,1,0,7,6,5,4,3,2,1,0,8,8,6,5,4,3,2,1,0,9,7,7,6,5,4,3,2,1,0,10,9,8,7,6,5,4,3,2,1,0,11,10,9,8,7,6,5,4,3,2,1,0,12,11,10,9,8,7,6,5,4,3,2,1,0,13,13,11,10,9,8", "name": "Signature permutations of RIBS-transformations of non-recursive Catalan automorphisms in table A089840.", "comment": ["Row n is the signature permutation of the Catalan automorphism which is obtained from the n-th nonrecursive automorphism in the table A089840 with the recursion scheme \"RIBS\".", "In this recursion scheme the given automorphism is applied to all (toplevel) subtrees of the Catalan structure, when it is interpreted as a general tree. Permutations in this table form a countable group, which is isomorphic with the group in A089840. (The RIBS transformation gives the group isomorphism.)", "Furthermore, row n of this table is also found as the row A123694(n) in tables A122203 and A122204. If the count of fixed points of the automorphism A089840[n] is given by sequence f, then the count of fixed points of the automorphism A089840[A123694(n)] is given by CONV(f,A000108) (where CONV stands for convolution) and the count of fixed points of the automorphism A122200[n] by INVERT(RIGHT(f)).", "The associated Scheme-procedures RIBS and !RIBS can be used to obtain such a transformed automorphism from any constructively or destructively implemented automorphism.", "Comment from Antti Karttunen, May 11 2008: This sequence agrees with A025581 in its initial terms, but then diverges from it."], "reference": ["A. Karttunen, paper in preparation, draft available by e-mail."], "link": ["<a href=\"/index/Per#IntegerPermutationCatAuto\">Index entries for signature-permutations of Catalan automorphisms</a>"], "program": ["(Scheme) (define (RIBS foo) (lambda (s) (map foo s)))", "(define (!RIBS foo!) (letrec ((bar! (lambda (s) (cond ((pair? s) (foo! (car s)) (bar! (cdr s)))) s))) bar!))"], "xref": ["Row 0 (identity permutation): A001477, row 1: A122282. See also tables A089840, A122201-A122204, A122283-A122284, A122285-A122288, A122289-A122290."], "keyword": "nonn,tabl", "offset": "0,4", "author": "_Antti Karttunen_, Sep 01 2006", "references": 20, "revision": 8, "time": "2012-03-31T13:21:11-04:00", "created": "2006-09-29T03:00:00-04:00"}]}