{"greeting": "Greetings from The On-Line Encyclopedia of Integer Sequences! http://oeis.org/", "query": "id:A129593", "count": 1, "start": 0, "results": [{"number": 129593, "data": "1,2,4,3,8,9,9,9,5,16,27,27,6,25,27,25,6,27,25,25,25,25,7,32,81,81,18,125,81,125,18,18,15,125,15,15,49,81,125,125,15,49,18,15,18,81,125,15,125,15,49,125,49,15,125,49,15,15,125,49,49,49,49,49,11,64,243,243,54", "name": "Prime-factorization encoded partition codes for the Łukasiewicz-words in A071153.", "comment": ["If the signature-permutation of a Catalan automorphism SP satisfies the condition A129593(SP(n)) = A129593(n) for all n, then it is called a Łukasiewicz-word permuting automorphism. In addition to all the automorphisms whose signature permutation satisfies the more restricted condition A127301(SP(n)) = A127301(n) for all n, this includes also certain automorphisms like *A072797 that do not preserve the non-oriented form of the general tree. A000041(n) distinct values occur in each range [A014137(n-1)..A014138(n-1)]. All natural numbers occur. Cf. A129599."], "link": ["A. Karttunen, <a href=\"/A129593/b129593.txt\">Table of n, a(n) for n = 0..2055</a>", "OEIS Wiki, <a href=\"/wiki/Łukasiewicz_words\">Łukasiewicz words</a>", "<a href=\"/index/Lu#Lukasiewicz\">Index entries for sequences related to Łukasiewicz</a>"], "formula": ["Construction: remove zeros from the Łukasiewicz-word of a general plane tree encoded by A014486(n) (i.e. A071153(n)), sort the numbers into ascending order and interpreting it as a partition of a natural number, encode it in the manner explained in A129595."], "example": ["The terms A071153(5..7) are 201, 210 and 120. After discarding zero and sorting, each produces partition 1+2. Converting it to prime-exponents like explained in A129595, we get 2^0 * 3^2 = 9, thus a(5) = a(6) = a(7) = 9."], "xref": ["a(n) = a(A072797(n)).", "Variant: A129599. To be computed: the position of the first and the last occurrence of n, the number of occurrences of each n."], "keyword": "nonn", "offset": "0,2", "author": "_Antti Karttunen_, May 01 2007", "references": 6, "revision": 10, "time": "2015-10-16T23:00:59-04:00", "created": "2007-05-11T03:00:00-04:00"}]}