{"greeting": "Greetings from The On-Line Encyclopedia of Integer Sequences! http://oeis.org/", "query": "id:A176723", "count": 1, "start": 0, "results": [{"number": 176723, "data": "1,1,0,1,0,1,1,0,0,0,1,1,0,0,0,0,0,1,1,0,0,0,0,0,1,0,0,1,1,1,0,0,0,0,0,0,0,0,0,1,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1,1,0,1,1,1,0,0,0,0,0,0,0,0,0", "name": "Characteristic array for partitions which define multiset repetition classes.", "comment": ["For the definition of multisets see, e.g., Stanley, p. 15.", "Partitions of natural numbers n are ordered according to Abramowitz-Stegun (A-St) order.", "Partitions of n>=1 are written in the exponent form (1^e[1], 2^e[2], 3^e[3],..., n^e[n]) with e[j] nonnegative numbers, for j=1,2,...,n, sum(e[j],j=1..n)=m (number of parts), and sum(j*e[j],j=1..n)=n. The empty partition for n=0 defines the empty multiset. In A115621 the multiset/partition of positive exponents is called the signature of the partition.", "The classes being represented are the classes with the same signature.", "Definition of multiset repetition class defining partitions: Every m part partition of n which has positive nonincreasing exponents defines a representative of a multiset repetition class of order m (a special m-multiset); i.e., the exponents of such partitions satisfy e[1] >= e[2] >= ... >= e[M] >= 1 with largest part M. This will satisfy T(M) <= n where T(M) = A000217(M) is the sequence of triangular numbers; for n>=1 every sufficiently small positive M does occur.", "Note that for each multiset repetition class the chosen defining partition (its representative) is the one with least n.", "See below for some examples."], "reference": ["M. Abramowitz and I. A. Stegun, eds., Handbook of Mathematical Functions, National Bureau of Standards Applied Math. Series 55, 1964 (and various reprintings), p. 831.", "R. P. Stanley, Enumerative Combinatorics, Cambridge University Press, Vol. 1, 1999."], "link": ["Wolfdieter Lang, <a href=\"/A176723/a176723.pdf\">First 20 rows, row sums and relevant partitions for n=1..15.</a>"], "formula": ["a(n,k)=1 if the k-th partition of n in A-St order (see above for the abbreviation A-St and a reference) is multiset defining and 0 else. The definition of a multiset repetition class defining partition is given above. See the examples below."], "example": ["[1]; [1]; [0|1]; [0|1|1]; [0|0,0|1|1]; [0|0,0|0,0|1|1]; [0|0,0,0|0,1,0|0,1|1|1];... For each row n (separated by ;) the | separates partitions with different number of parts.", "For n=6 the entry 1 at the 6th position stands for the partition (1^1,2^1,3^1)=(1,2,3) in A-St order.", "The m=3 multiset corresponding to partition (1,2,3) coincides with the ordinary 3-set {1,2,3}.", "Partition (1^4,2^1) = (1^4,2) (marking the next-to-last entry in row n=6) corresponds to the (m=5)-multiset {1,1,1,1,2}."], "xref": ["Row lengths A000041, row sums A007294, corresponding triangle with like m positions summed A176724.", "Cf. A012257, A036036, A115621."], "keyword": "nonn,easy,tabf", "offset": "0", "author": "_Wolfdieter Lang_, Jul 14 2010", "ext": ["Edited by the author and _Franklin T. Adams-Watters_, Apr 02 2011"], "references": 12, "revision": 24, "time": "2018-06-09T13:41:10-04:00", "created": "2010-07-31T03:00:00-04:00"}]}