{"greeting": "Greetings from The On-Line Encyclopedia of Integer Sequences! http://oeis.org/", "query": "id:A182618", "count": 1, "start": 0, "results": [{"number": 182618, "data": "6,4,3,3,3,3,2,3,3,2,3,2,3,2,3,2,3,2,2,3,2,3,2,2,3,2,2,3,2,2,3,2,2,3,2,2,2,3,2,2,3,2,2,2,3,2,2,2,3,2,2,2,3,2,2,2,3,2,2,2,2,3,2,2,2,3,2,2,2,2,3,2,2,2,2,3", "name": "Number of new grid points that are covered by the toothpicks added at n-th-stage to the toothpick spiral of A182617.", "comment": ["In the toothpick spiral the toothpicks are connected by their endpoints. See A182617 for more information.", "Attempt at an explanation, _R. J. Mathar_, Dec 13 2010: (Start)", "In the hexagonal grid, we can pick any of the hexagons as a center, and then define a ring of 6 first neighbors (hexagons adjacent to the center), then define a ring of 12 second neighbors (hexagons adjacent to any of the first ring) and so on. The current sequence describes a self-avoiding walk which starts in a spiral around the center hexagon, which covers 5 edges. The walk then takes one step to reach the rim of the first ring and travels once around this ring until it reaches a point where self-avoidance stops it. It then takes one step to reach the rim of the second ring and walks around that one, etc. Imagine that on each edge we place a toothpick if it's on the path, and interrupt counting the total number of toothpicks each time one of the hexagons has six vertices covered. The first differences of these intermediate totals define the sequence. (End)"], "link": ["David Applegate, Omar E. Pol and N. J. A. Sloane, <a href=\"/A000695/a000695_1.pdf\">The Toothpick Sequence and Other Sequences from Cellular Automata</a>, Congressus Numerantium, Vol. 206 (2010), 157-191. [There is a typo in Theorem 6: (13) should read u(n) = 4.3^(wt(n-1)-1) for n >= 2.]", "N. J. A. Sloane, <a href=\"/wiki/Catalog_of_Toothpick_and_CA_Sequences_in_OEIS\">Catalog of Toothpick and Cellular Automata Sequences in the OEIS</a>", "<a href=\"/index/To#toothpick\">Index entries for sequences related to toothpick sequences</a>"], "example": ["At stage 1, starting from a node on the hexagonal net, we place 5 toothpicks on 5 edges of the first hexagon, so a(1)= 6 because there are 6 grid points that are covered by the toothpicks.", "At stage 2, starting from the last exposed endpoints, we place 4 toothpicks on the edges of the second hexagon, so a(2)=4 because there are new 4 grid points that are covered by the toothpicks.", "At stage 3, starting from the last exposed endpoints we place 3 toothpicks on the edges of the third hexagon, so a(3)=3 because there are new 3 grid points covered. Etc.", "If written as a triangle, begins:", "6,", "4,3,3,3,3,2,", "3,3,2,3,2,3,2,3,2,3,2,2,", "3,2,3,2,2,3,2,2,3,2,2,3,2,2,3,2,2,2,", "3,2,2,3,2,2,2,3,2,2,2,3,2,2,2,3,2,2,2,3,2,2,2,2,", "3,2,2,2,3,2,2,2,2,3,2,2,2,2,3,2,2,2,2,3,2,2,2,2,3,2,2,2,2,2"], "xref": ["Cf. A121149, A139250, A139251, A182617, A182619, A182632, A182840.", "Row n has A008458(n-1) terms. Row sums give A017593."], "keyword": "nonn,tabf", "offset": "1,1", "author": "_Omar E. Pol_, Dec 12 2010", "references": 3, "revision": 23, "time": "2021-02-24T02:48:19-05:00", "created": "2010-11-22T19:57:28-05:00"}]}