{"greeting": "Greetings from The On-Line Encyclopedia of Integer Sequences! http://oeis.org/", "query": "id:A186705", "count": 1, "start": 0, "results": [{"number": 186705, "data": "0,1,3,5,7,9,12,14,18,20,23,27,30,33", "name": "The maximum number of occurrences of the same distance among n points in the plane.", "comment": ["An upper bound is floor(k*n^(4/3)), A129011 if k is near enough to 1.", "a(21)=57.", "a(27)=81 (Hamming 3,3 graph). - _Ed Pegg Jr_, Feb 02 2018"], "reference": ["P. Brass, W. O. J. Moser, J. Pach, Research Problems in Discrete Geometry, Springer (2005), p. 183"], "link": ["Jean-Paul Delahaye, <a href=\"http://www.pourlascience.fr/ewb_pages/a/article-les-graphes-allumettes-33448.php\">Les graphes-allumettes</a>, (in French), Pour la Science no. 445, November 2014, pages 108-113. (On page 112, for n=6, drawing 2, one segment is missing.)", "Ed Pegg Jr, <a href=\"https://math.stackexchange.com/questions/2575268/maximally-dense-unit-distance-graphs\">Maximally Dense Unit Distance Graphs</a>"], "example": ["a(4) = 5 because there is a unit distance graph with 4 vertices of an equilateral rhombus such that all but one of the six pairs of vertices are unit distance apart.", "Comment from _Allan C. Wechsler_, Sep 17 2018: (Start)", "Construction for a(9)=18: Take a convex, equilateral hexagon ABCDEF. Make the angles vary a bit, though, to avoid the hexagon being regular. Now, on each of the six sides, construct an equilateral triangle pointing into the hexagon. In general, the triangles will overlap here and there; this is OK because we aren't going to care about edges crossing each other. So we have triangles ABU, BCV, CDW, DEX, EFY, and FAZ: a total of twelve points with 18 unit distances among them.", "Now adjust the hexagon to make some pairs of the internal points coincide. We want to make U=X, V=Y, and W=Z. The resulting linkage still has one degree of freedom, so we can arrange it so that none of the edges coincide (they can and must cross, though). The adjusted hexagon will only have two different angles: ABC = CDE = EFA, and BCD = DEF = FAB. The whole thing will have triangular (D_6) symmetry. It will have nine vertices (after merging three pairs from the original 12) but it will still have 18 unit edges. (End)"], "keyword": "nonn,hard,more,nice", "offset": "1,3", "author": "_Michael Somos_, Feb 25 2011", "references": 1, "revision": 30, "time": "2019-01-09T01:52:51-05:00", "created": "2011-02-25T20:13:16-05:00"}]}