{"greeting": "Greetings from The On-Line Encyclopedia of Integer Sequences! http://oeis.org/", "query": "id:A194277", "count": 1, "start": 0, "results": [{"number": 194277, "data": "2,4,3,6,7,2,7,7,2,3,3,1,0,1,1,0,0,1,0,0,0,1", "name": "Known number of distinct polygonal shapes with n sides in the infinite D-toothpick structure of A194270.", "comment": ["WARNING: The numbers are not fully tested. A new polygonal shape may appear in the structure beyond the stage 128 of A194270.", "The cellular automaton of A194270 contains a large number of distinct polygonal shapes. For simplicity we call \"polygons\" to polygonal shapes.", "In order to construct this sequence we use the following rules:", "- Consider only the convex polygons and the concave polygons. Self-intersecting polygons are not counted (Note that some polygons contain in their body a toothpick or D-toothpick with an exposed endpoint; that element is not a part of the perimeter of the polygons).", "- If two polygons have the same shape but they have different size then these polygons must be counted as distinct types of polygons.", "- The reflected shapes of asymmetric polygons, both with the same area, must be counted as distinct types of polygons.", "For more information see A194276 and A194278."], "link": ["N. J. A. Sloane, <a href=\"/wiki/Catalog_of_Toothpick_and_CA_Sequences_in_OEIS\">Catalog of Toothpick and Cellular Automata Sequences in the OEIS</a>", "<a href=\"/index/To#toothpick\">Index entries for sequences related to toothpick sequences</a>"], "example": ["Consider toothpicks of length 2 and D-toothpicks of length sqrt(2):", "a(3) = 2 because the structure contains 2 types of triangles, each with area: 1, 2.", "a(4) = 4 because the structure contains 4 types of quadrilaterals: 3 squares, each with area: 2, 4, 8 and also a rectangle with area 8.", "a(5) = 3 because the structure contains 3 types of pentagons: a concave pentagon with area = 3 and also 2 convex pentagons with area 5 and 6.", "a(12) = 3 because the structure contains 3 types of dodecagons: a symmetric concave dodecagon with area 29 and also 2 asymmetrict concave dodecagons both with area = 18. These last dodecagons are essentially equal but with reflected shape, so a(12) = 3 not 2."], "xref": ["Cf. A194270, A194276, A194278, A194444."], "keyword": "nonn,more,hard", "offset": "3,1", "author": "_Omar E. Pol_, Aug 25 2011", "references": 7, "revision": 49, "time": "2015-09-26T01:17:13-04:00", "created": "2011-08-25T11:44:25-04:00"}]}