{"greeting": "Greetings from The On-Line Encyclopedia of Integer Sequences! http://oeis.org/", "query": "id:A206496", "count": 1, "start": 0, "results": [{"number": 206496, "data": "1,1,1,1,1,3,1,1,3,4,1,6,3,4,10,1,1,15,1,10,10,5,3,10,10,15,15,10,4,60,1,1,15,5,20,45,6,5,45,20,3,60,4,15,105,18,10,15,10,70,15,45,1,105,35,20,15,24,1,210,15,6,105,1,105,105,1,15,63,140", "name": "The Connes-Moscovici weight of the rooted tree with Matula-Goebel number n. It is defined as the number of ways to build up the rooted tree from the one-vertex tree by adding successively edges to the existing vertices.", "comment": ["See A206494 for the number of ways to take apart the rooted tree corresponding to the Matula-Goebel number n by sequentially removing terminal edges.", "The Matula-Goebel number of a rooted tree can be defined in the following recursive manner: to the one-vertex tree there corresponds the number 1; to a tree T with root degree 1 there corresponds the t-th prime number, where t is the Matula-Goebel number of the tree obtained from T by deleting the edge emanating from the root; to a tree T with root degree m>=2 there corresponds the product of the Matula-Goebel numbers of the m branches of T."], "reference": ["F. Goebel, On a 1-1 correspondence between rooted trees and natural numbers, J. Combin. Theory, B 29 (1980), 141-143.", "I. Gutman and A. Ivic, On Matula numbers, Discrete Math., 150, 1996, 131-142.", "I. Gutman and Y-N. Yeh, Deducing properties of trees from their Matula numbers, Publ. Inst. Math., 53 (67), 1993, 17-22.", "D. W. Matula, A natural rooted tree enumeration by prime factorization, SIAM Review, 10, 1968, 273.", "J. C. Butcher, The Numerical Analysis of Ordinary Differential Equations, 1987), Wiley, Chichester.", "Ch. Brouder, Runge-Kutta methods and renormalization, Eur. Phys. J. C 12, 2000, 521-534.", "D. J. Broadhurst and D. Kreimer, Renormalization automated by Hopf algebra, J. Symbolic Computation, 27, 1999, 581-600.", "J. Fulman, Mixing time for a random walk on rooted trees, The Electronic J. of Combinatorics, 16, 2009, R139."], "link": ["E. Deutsch, <a href=\"http://arxiv.org/abs/1111.4288\"> Rooted tree statistics from Matula numbers</a>, arXiv:1111.4288.", "<a href=\"/index/Mat#matula\">Index entries for sequences related to Matula-Goebel numbers</a>"], "formula": ["a(n) = V(n)!/[TF(n)*SF(n)], where V denotes \"number of vertices\" (A061775), TF denotes \"tree factorial\" (A206493), and SF denotes \"symmetry factor\" (A206497)."], "example": ["a(6)=3 because the rooted tree with Matula-Goebel number 6 is the path ARBC with root at R; starting with R we can obtain the tree ARBC by adding successively edges at the vertices  (i) R, R, A or at (ii) R, R, B, or at (iii) R, A, R.", "a(8)=1 because the rooted tree with Matula-Goebel number 8 is the star tree with 3 edges emanating from the root; obviously, there is only 1 way to build up this tree from the root."], "maple": ["with(numtheory): V := proc (n) local r, s: r := proc (n) options operator, arrow: op(1, factorset(n)) end proc: s := proc (n) options operator, arrow: n/r(n) end proc: if n = 1 then 1 elif bigomega(n) = 1 then 1+V(pi(n)) else V(r(n))+V(s(n))-1 end if end proc: TF := proc (n) local r, s: r := proc (n) options operator, arrow: op(1, factorset(n)) end proc: s := proc (n) options operator, arrow; n/r(n) end proc: if n = 1 then 1 elif bigomega(n) = 1 then V(n)*TF(pi(n)) else TF(r(n))*TF(s(n))*V(n)/(V(r(n))*V(s(n))) end if end proc: SF := proc (n) if n = 1 then 1 elif nops(factorset(n)) = 1 then factorial(log[factorset(n)[1]](n))*SF(pi(factorset(n)[1]))^log[factorset(n)[1]](n) else SF(expand(op(1, ifactor(n))))*SF(expand(n/op(1, ifactor(n)))) end if end proc: a := proc (n) options operator, arrow: factorial(V(n))/(TF(n)*SF(n)) end proc: seq(a(n), n = 1 .. 120);"], "xref": ["Cf. A061775, A206493, A206497, A206494"], "keyword": "nonn", "offset": "1,6", "author": "_Emeric Deutsch_, Jul 20 2012", "references": 2, "revision": 12, "time": "2017-03-07T11:24:56-05:00", "created": "2012-07-21T02:14:17-04:00"}]}