{"greeting": "Greetings from The On-Line Encyclopedia of Integer Sequences! http://oeis.org/", "query": "id:A243073", "count": 1, "start": 0, "results": [{"number": 243073, "data": "1,2,4,3,8,6,16,5,9,12,24,10,40,24,18,7,56,15,88,20,36,36,104,14,27,60,25,40,136,30,152,11,54,84,54,21,184,132,90,28,232,60,248,60,50,156,296,22,108,45,126,100,328,35,81,56,198,204,344,42,376,228,100,13,135", "name": "Third order Bulgarian solitaire operation on partition list A112798: a(1) = 1, a(n) = A000040(A001222(n)) * A243072(A064989(n)).", "comment": ["The usual (first order) Bulgarian Solitaire operation (cf. A242424) applied to an unordered integer partition means: subtract one from each part, and add a new part as large as there were parts in the old partition.", "The \"Second Order Bulgarian Operation\" means that after subtracting one from each part of the old partition (and discarding the parts that diminished to zero), we apply the (first order) Bulgarian operation to the remaining partition before adding a new part as large as there were parts in the original partition.", "Similarly, in \"Third Order Bulgarian Solitaire Operation\", we apply the Second Order Bulgarian operation to the remaining partition (after we have subtracted one from each part) before adding a new part as large as there were parts in the original partition.", "In this context, where the parts of partitions are encoded with the indices of primes in the prime factorization of n (as in A112798), A064989(n) gives the remaining partition after one has been subtracted from each part; A243072 applies the second order Bulgarian operation to it; and multiplying with A000040(A001222(n)) adds a part as large as there originally were parts."], "link": ["Antti Karttunen, <a href=\"/A243073/b243073.txt\">Table of n, a(n) for n = 1..8192</a>"], "formula": ["a(1) = 1, a(n) = A000040(A001222(n)) * A243072(A064989(n)) = A105560(n) * A243072(A064989(n)).", "a(n) = A241909(A243053(A241909(n)))."], "program": ["(Scheme, with _Antti Karttunen_'s IntSeq-library)", "(definec (A243073 n) (if (<= n 1) n (* (A000040 (A001222 n)) (A243072 (A064989 n)))))"], "xref": ["Row 3 of A243070. Differs from A122111 for the first time at n=11.", "Cf. A242424, A243072, A112798, A105560, A000040, A001222, A064989, A243053, A241909."], "keyword": "nonn", "offset": "1,2", "author": "_Antti Karttunen_, May 29 2014", "references": 7, "revision": 11, "time": "2014-06-21T14:21:33-04:00", "created": "2014-06-21T14:21:33-04:00"}]}