{"greeting": "Greetings from The On-Line Encyclopedia of Integer Sequences! http://oeis.org/", "query": "id:A254434", "count": 1, "start": 0, "results": [{"number": 254434, "data": "1,1,1,2,1,1,2,1,1,2,1,2,7,1,1,2,1,1,2,1,1,5,1", "name": "The number of isomorphism classes of Latin keis (involutory right distributive quasigroups) of order 2n+1.", "comment": ["A quandle (Q,*) is a kei or involutory quandle if for all x,y in Q we have (x*y)*y = x, that is, all right translations R_a: x-> x*a, are involutions. A quandle (Q,*) is a quasigroup if also the mappings L_a: x->a*x are bijections.", "Masahico Saito noticed that there are no Latin keis of even order. Here is a simple proof: Suppose that Q is a Latin kei of order n and that n is even. Let R_a be the permutation of Q given by R_a(x) = x*a. Since R_a is an involution it is a product of t transpositions. Let f be the number of fixed points of R_a. Then n = 2*t + f. Since R_a(a) = a and n is even, there must be a fixed point x different from a. Hence x*a = x and x*x = x. So L_x is not a bijection. This shows that Q is not Latin, so the result is proved.", "There is at least one Latin kei of order n for any odd n: Consider the Latin kei defined on Z/(n) by the rule x*y = -x + 2y.", "Leandro Vendramin (see link below) has found all connected quandles of order n for n at most 47. (There are 790 of them, not counting the one of order 1.) A Latin quandle is connected. So this sequence was found by just going through Vendramin's list and counting the quandles which are Latin keis."], "link": ["Scott Carter, <a href=\"http://arxiv.org/abs/1002.4429\"> A Survey of Quandle Ideas</a>, arXiv:1002.4429 [math.GT], 2010.", "Leandro Vendramin and Matías Graña,<a href=\"https://code.google.com/p/rig/\"> Rig, a GAP package for racks and quandles.</a>", "Leandro Vendramin,<a href=\"http://arxiv.org/abs/1105.5341\"> On the classification of quandles of low order</a>, arXiv:1105.5341 [math.GT], 2011-2012.", "S. K. Stein, <a href=\"http://dx.doi.org/10.1090/S0002-9947-1957-0094404-6\"> On the Foundations of Quasigroups</a>, Transactions of American Mathematical Society, 85 (1957), 228-256."], "xref": ["A248908 is this sequence with a(2n) = 0 interleaved."], "keyword": "hard,more,nonn", "offset": "0,4", "author": "_W. Edwin Clark_, Mar 07 2015", "references": 2, "revision": 27, "time": "2018-06-03T02:18:20-04:00", "created": "2015-03-07T15:30:26-05:00"}]}