{"greeting": "Greetings from The On-Line Encyclopedia of Integer Sequences! http://oeis.org/", "query": "id:A262626", "count": 1, "start": 0, "results": [{"number": 262626, "data": "1,1,1,3,2,2,2,2,2,1,1,2,7,3,1,1,3,3,3,3,2,2,3,12,4,1,1,1,1,4,4,4,4,2,1,1,2,4,15,5,2,1,1,2,5,5,3,5,5,2,2,2,2,5,9,9,6,2,1,1,1,1,2,6,6,6,6,3,1,1,1,1,3,6,28,7,2,2,1,1,2,2,7,7,7,7,3,2,1,1,2,3,7,12,12,8,3,1,2,2,1,3,8,8,8,8,8,3,2,1,1", "name": "Visible parts of the perspective view of the stepped pyramid whose structure essentially arises after the 90-degree-zig-zag folding of the isosceles triangle A237593.", "comment": ["Also the rows of both triangles A237270 and A237593 interleaved.", "Also, irregular triangle read by rows in which T(n,k) is the area of the k-th region (from left to right in ascending diagonal) of the n-th symmetric set of regions (from the top to the bottom in descending diagonal) in the two-dimensional diagram of the perspective view of the infinite stepped pyramid described in A245092 (see the diagram in the Links section).", "The diagram of the symmetric representation of sigma is also the top view of the pyramid, see Links section. For more information about the diagram see also A237593 and A237270.", "The number of cubes at the n-th level is also A024916(n), the sum of all divisors of all positive integers <= n.", "Note that this pyramid is also a quarter of the pyramid described in A244050. Both pyramids have infinitely many levels.", "Odd-indexed rows are also the rows of the irregular triangle A237270.", "Even-indexed rows are also the rows of the triangle A237593.", "Lengths of the odd-indexed rows are in A237271.", "Lengths of the even-indexed rows give 2*A003056.", "Row sums of the odd-indexed rows gives A000203, the sum of divisors function.", "Row sums of the even-indexed rows give the positive even numbers (see A005843).", "Row sums give A245092.", "From the front view of the stepped pyramid emerges a geometric pattern which is related to A001227, the number of odd divisors of the positive integers.", "The connection with the odd divisors of the positive integers is as follows: A261697 --> A261699 --> A237048 --> A235791 --> A237591 --> A237593 --> A237270 --> this sequence."], "link": ["Robert Price, <a href=\"/A262626/b262626.txt\">Table of n, a(n) for n = 1..16048</a> (n=1..412 rows)", "Omar E. Pol, <a href=\"http://www.polprimos.com/imagenespub/polpyr01.jpg\">An infinite stepped pyramid (A237593, A237270, A262626)</a>", "Omar E. Pol, <a href=\"http://www.polprimos.com/imagenespub/polpyr02.jpg\">Diagram of the isosceles triangle A237593 before the 90-degree-zig-zag folding (rows: 1..28)</a>", "Omar E. Pol, <a href=\"http://www.polprimos.com/imagenespub/polpyr05.jpg\">Perspective view of the pyramid (levels: 1..16)</a>", "<a href=\"/index/Si#SIGMAN\">Index entries for sequences related to sigma(n)</a>"], "example": ["Irregular triangle begins:", "  1;", "  1, 1;", "  3;", "  2, 2;", "  2, 2;", "  2, 1, 1, 2;", "  7;", "  3, 1, 1, 3;", "  3, 3;", "  3, 2, 2, 3;", "  12;", "  4, 1, 1, 1, 1, 4;", "  4, 4;", "  4, 2, 1, 1, 2, 4;", "  15;", "  5, 2, 1, 1, 2, 5;", "  5, 3, 5;", "  5, 2, 2, 2, 2, 5;", "  9, 9;", "  6, 2, 1, 1, 1, 1, 2, 6;", "  6, 6;", "  6, 3, 1, 1, 1, 1, 3, 6;", "  28;", "  7, 2, 2, 1, 1, 2, 2, 7;", "  7, 7;", "  7, 3, 2, 1, 1, 2, 3, 7;", "  12, 12;", "  8, 3, 1, 2, 2, 1, 3, 8;", "  8, 8, 8;", "  8, 3, 2, 1, 1, 1, 1, 2, 3, 8;", "  31;", "  9, 3, 2, 1, 1, 1, 1, 2, 3, 9;", "  ...", "Illustration of the odd-indexed rows of triangle as the diagram of the symmetric representation of sigma which is also the top view of the stepped pyramid:", ".", "   n  A000203    A237270    _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _", "   1     1   =      1      |_| | | | | | | | | | | | | | | |", "   2     3   =      3      |_ _|_| | | | | | | | | | | | | |", "   3     4   =    2 + 2    |_ _|  _|_| | | | | | | | | | | |", "   4     7   =      7      |_ _ _|    _|_| | | | | | | | | |", "   5     6   =    3 + 3    |_ _ _|  _|  _ _|_| | | | | | | |", "   6    12   =     12      |_ _ _ _|  _| |  _ _|_| | | | | |", "   7     8   =    4 + 4    |_ _ _ _| |_ _|_|    _ _|_| | | |", "   8    15   =     15      |_ _ _ _ _|  _|     |  _ _ _|_| |", "   9    13   =  5 + 3 + 5  |_ _ _ _ _| |      _|_| |  _ _ _|", "  10    18   =    9 + 9    |_ _ _ _ _ _|  _ _|    _| |", "  11    12   =    6 + 6    |_ _ _ _ _ _| |  _|  _|  _|", "  12    28   =     28      |_ _ _ _ _ _ _| |_ _|  _|", "  13    14   =    7 + 7    |_ _ _ _ _ _ _| |  _ _|", "  14    24   =   12 + 12   |_ _ _ _ _ _ _ _| |", "  15    24   =  8 + 8 + 8  |_ _ _ _ _ _ _ _| |", "  16    31   =     31      |_ _ _ _ _ _ _ _ _|", "  ...", "The above diagram arises from a simpler diagram as shown below.", "Illustration of the even-indexed rows of triangle as the diagram of the deployed front view of the corner of the stepped pyramid:", ".", ".                                 A237593", "Level                               _ _", "1                                 _|1|1|_", "2                               _|2 _|_ 2|_", "3                             _|2  |1|1|  2|_", "4                           _|3   _|1|1|_   3|_", "5                         _|3    |2 _|_ 2|    3|_", "6                       _|4     _|1|1|1|1|_     4|_", "7                     _|4      |2  |1|1|  2|      4|_", "8                   _|5       _|2 _|1|1|_ 2|_       5|_", "9                 _|5        |2  |2 _|_ 2|  2|        5|_", "10              _|6         _|2  |1|1|1|1|  2|_         6|_", "11            _|6          |3   _|1|1|1|1|_   3|          6|_", "12          _|7           _|2  |2  |1|1|  2|  2|_           7|_", "13        _|7            |3    |2 _|1|1|_ 2|    3|            7|_", "14      _|8             _|3   _|1|2 _|_ 2|1|_   3|_             8|_", "15    _|8              |3    |2  |1|1|1|1|  2|    3|              8|_", "16   |9                |3    |2  |1|1|1|1|  2|    3|                9|", "...", "The number of horizontal line segments in the n-th level in each side of the diagram equals A001227(n), the number of odd divisors of n.", "The number of horizontal line segments in the left side of the diagram plus the number of the horizontal line segment in the right side equals A054844(n).", "The total number of vertical line segments in the n-th level of the diagram equals A131507(n).", "The diagram represents the first 16 levels of the pyramid.", "The diagram of the isosceles triangle and the diagram of the top view of the pyramid shows the connection between the partitions into consecutive parts and the sum of divisors function (see also A286000). - _Omar E. Pol_, Aug 28 2018"], "xref": ["Famous sequences that are visible in the pyramid:", "Cf. A000040 (prime numbers),", "Cf. A000079 (powers of 2).", "Cf. A000203 (sum of divisors).", "Cf. A000217 (triangular numbers).", "Cf. A000225 (Mersenne numbers).", "Cf. A000384 (hexagonal numbers).", "Cf. A000396 (perfect numbers).", "Cf. A000668 (Mersenne primes).", "Cf. A001097 (twin primes).", "Cf. A002378 (oblong numbers).", "Cf. A019434 (Fermat primes).", "Other sequences that are visible in the pyramid: A000096, A001227, A001359, A001747, A002939, A002943, A003056, A004125, A004277, A005279, A006512, A007606, A007607, A008578, A008864, A010814, A014105, A014106, A014107, A014132, A014574, A024206, A024916, A028552, A028982, A028983, A034856, A047836, A048050, A052928, A054735, A054844, A065091, A065475, A071561, A071562, A071904, A092506, A100484, A108605, A139256, A139257, A144396, A152677, A152678, A153485, A155085, A161680, A162917, A161983, A174905, A174973, A175254, A176810, A224880, A237591, A237593, A237270, A237271, A238524, A245092, A259176, A259177, A278972, A317302, A317303, A317304, A317305, A317307, A319529, A319796, A319801, A319802, (and possibly more).", "Cf. A054844, A067742, A131507, A196020, A236104, A235791, A237048, A239660, A244050, A259179, A261350, A261697, A261699, A262612, A280850, A286000, A286001, A296508."], "keyword": "nonn,tabf,look", "offset": "1,4", "author": "_Omar E. Pol_, Sep 26 2015", "references": 118, "revision": 144, "time": "2021-03-26T08:36:02-04:00", "created": "2016-11-09T08:04:41-05:00"}]}