{"greeting": "Greetings from The On-Line Encyclopedia of Integer Sequences! http://oeis.org/", "query": "id:A263849", "count": 1, "start": 0, "results": [{"number": 263849, "data": "1,6,12,24,32,24,54,24,24,30,24,48,48,96,24,48,96,48,24,120,108,48,72,48,120,54,48,48,48,84,72,120,72,78,48,144", "name": "Let R = Z((1+sqrt{5})/2) denote the ring of integers in the real quadratic number field of discriminant 5. Let nu in R be a totally positive element of norm m = A031363(n). Then a(n) is the number of ways of writing nu as a sum of three squares in R.", "comment": ["Let R = Z((1+sqrt{5})/2) denote the ring of integers in the real quadratic number field of discriminant 5. The main result of Maass (1941) is that every totally positive nu in R is a sum of 3 squares x^2+y^2+z^2 with x,y,z in R. The number N_{nu} of such representations is given by the formula in the theorem on page 191. The norms of the totally positive elements nu are rational integers m belonging to A031363, so we can order the terms of the sequence according to the values m = A031363(n). [Comment based on remarks from Gabriele Nebe.]", "The terms were computed with the aid of Magma by David Durstoff, Nov 11 2015.", "The attached file from David Durstoff gives list of pairs m=A031363(n), a(n), and also the initial terms of Maass's series theta(tau).  David Durstoff says: \"I expressed theta(tau) in terms of two variables q1 and q2. The coefficient of q1^k q2^m is a(nu) with k = trace(nu/delta) and m = trace(nu), where delta = (5+sqrt{5})/2 is a generator of the different ideal. I computed the terms for q1^0 to q1^10 and all possible powers of q2.\""], "reference": ["Maass, Hans. Über die Darstellung total positiver Zahlen des Körpers R (sqrt(5)) als Summe von drei Quadraten, Abhandlungen aus dem Mathematischen Seminar der Universität Hamburg. Vol. 14. No. 1, pp. 185-191, 1941."], "link": ["David Durstoff, <a href=\"/A263849/a263849.txt\">Table showing list of pairs m=A031363(n), a(n)  </a>"], "xref": ["Cf. A031363 (the norms), A035187 (number of ideals with that norm).", "See A263850 for another version of this sequence."], "keyword": "nonn,more", "offset": "0,2", "author": "_N. J. A. Sloane_, Nov 15 2015", "references": 3, "revision": 29, "time": "2015-11-18T12:11:38-05:00", "created": "2015-11-15T12:44:52-05:00"}]}