{"greeting": "Greetings from The On-Line Encyclopedia of Integer Sequences! http://oeis.org/", "query": "id:A277437", "count": 1, "start": 0, "results": [{"number": 277437, "data": "1,3,2,5,4,9,7,6,12,20,8,10,21,36,72,11,13,25,50,91,144,14,16,32,56,112", "name": "Square array read by antidiagonals upwards in which T(n,k) is the n-th number j such that, descending by the main diagonal of the pyramid described in A245092, the height difference between the level j (starting from the top) and the level of the next terrace is equal to k.", "comment": ["This is a permutation of the natural numbers.", "Column k lists the numbers with precipice k. For more information about the precipices see A280223 and A280295.", "The structure of the stepped pyramid arises after the 90-degree-zig-zag folding of the diagram of the isosceles triangle A237593.", "The terraces at the m-th level of the pyramid are also the parts of the symmetric representation of sigma(m), m >= 1.", "The stepped pyramid is also one of the 3D-quadrants of the stepped pyramid described in A244050.", "If a number m is in the column k and k > 1 then m + 1 is the column k - 1.", "The largest Dyck path of the symmetric representations of next k - 1 positive integers greater than T(n,k) shares the middle point of the largest Dyck path of the symmetric representation of sigma(T(n,k)). For more information see A237593."], "link": ["Omar E. Pol, <a href=\"http://www.polprimos.com/imagenespub/polpyr05.jpg\">Perspective view of the pyramid (first 16 levels)</a>", "<a href=\"/index/Per#IntegerPermutation\">Index entries for sequences that are permutations of the natural numbers</a>"], "formula": ["T(n,1) = A071562(n+1) - 1."], "example": ["The corner of the square array begins:", "   1,  2,  9, 20, 72, 144,", "   3,  4, 12, 36, 91,", "   5,  6, 21, 50,", "   7, 10, 25,", "   8, 13,", "  11,", "  ...", "T(1,6) = 144 because it is the smallest number with precipice 6."], "xref": ["Row 1 gives A280295.", "Column 1 gives A276112.", "Cf. A000203, A071562, A196020, A235791, A236104, A237270, A237271, A237591, A237593, A240542, A244050, A245092, A259179, A262626, A279286, A279385, A280223."], "keyword": "nonn,tabl,more", "offset": "1,2", "author": "_Omar E. Pol_, Dec 29 2016", "ext": ["a(20)-a(26) from _Omar E. Pol_, Jan 02 2017"], "references": 7, "revision": 64, "time": "2020-12-31T11:11:15-05:00", "created": "2016-12-31T01:45:12-05:00"}]}