{"greeting": "Greetings from The On-Line Encyclopedia of Integer Sequences! http://oeis.org/", "query": "id:A296511", "count": 1, "start": 0, "results": [{"number": 296511, "data": "1,2,4,6,6,6,6,10,16,20,16,10,6,10,16,24,28,32,28,32,40,50,40,22,8,10,16,24,28,32,32,40,56,74,76,64,42,36,40,62,76,90,80,88,102,122,96,50,14,10,16,24,28,32,32,40,56,74,76,64", "name": "Number of toothpicks added at n-th stage to the toothpick structure of A296510.", "comment": ["The structure and the behavior of this cellular automaton reveals that some cellular automata have recurrent periods that can be represented by irregular triangles of first differences whose row lengths are the terms of A011782 multiplied by k (instead of powers of 2), where k is the length of their \"word\". In this case the word must be \"abc\", therefore k = 3. In the case of the cellular automaton with normal toothpicks (A139250) the word must be \"ab\" and k = 2.", "The associated sound to the animation of this cellular automaton could be [tick, tock, tack], [tic, tock, tack], and so on.", "For more information about the \"word\" of a cellular automaton see A296612."], "link": ["N. J. A. Sloane, <a href=\"/wiki/Catalog_of_Toothpick_and_CA_Sequences_in_OEIS\">Catalog of Toothpick and Cellular Automata Sequences in the OEIS</a>", "<a href=\"/index/Ce#cell\">Index entries for sequences related to cellular automata</a>", "<a href=\"/index/To#toothpick\">Index entries for sequences related to toothpick sequences</a>"], "example": ["The structure of this irregular triangle is as shown below:", "   a, b, c;", "   a, b, c;", "   a, b, c, a, b, c;", "   a, b, c, a, b, c, a, b, c, a, b, c;", "   a, b, c, a, b, c, a, b, c, a, b, c, a, b, c, a, b, c, a, b, c, a, b, c;", "...", "Every column is associated successively to one of the axes of the triangular grid.", "Every row represents a geometric period of the cellular automaton.", "So, written as an irregular triangle in which the row lengths are the terms of A011782 multiplied by 3, the sequence begins:", "   1, 2, 4;", "   6, 6, 6;", "   6,10,16,20,16,10;", "   6,10,16,24,28,32,28,32,40,50,40,22;", "   8,10,16,24,28,32,32,40,56,74,76,64,42,36,40,62,76,90,80,88,102,122,96,50;", "  14,10,16,24,28,32,32,40,56,74,76,64,...", "..."], "xref": ["First differences of A296510.", "Cf. A160121 (word \"a\"), A139251 (word \"ab\"), A299477 (word \"abcb\"), A299479 (word \"abcbc\").", "Cf. A007283, A011782, A151906, A160121, A160161."], "keyword": "nonn,tabf,more", "offset": "1,2", "author": "_Omar E. Pol_, Dec 14 2017", "references": 6, "revision": 34, "time": "2019-02-04T14:01:31-05:00", "created": "2019-02-04T14:01:31-05:00"}]}