{"greeting": "Greetings from The On-Line Encyclopedia of Integer Sequences! http://oeis.org/", "query": "id:A338315", "count": 1, "start": 0, "results": [{"number": 338315, "data": "0,0,0,0,0,1,0,3,2,4,4,10,6,15,13,16,21,31,29,43,41,50,63,79,81,99,113,129,145,179,197,228,249,284,328,363,418,472,522,581,655,741,828,921,1008,1123,1259,1407,1546,1709,1889,2077,2292,2554,2799,3061,3369", "name": "Number of integer partitions of n with no 1's whose distinct parts are pairwise coprime, where a singleton is not considered coprime unless it is (1).", "comment": ["The Heinz numbers of these partitions are given by A337987. The Heinz number of an integer partition (y_1,...,y_k) is prime(y_1)*...*prime(y_k), giving a bijective correspondence between positive integers and integer partitions."], "example": ["The a(5) = 1 through a(13) = 15 partitions (empty column indicated by dot, A = 10, B = 11):", "  32   .  43    53    54     73     65      75      76", "          52    332   72     433    74      543     85", "          322         522    532    83      552     94", "                      3222   3322   92      732     A3", "                                    443     5322    B2", "                                    533     33222   544", "                                    722             553", "                                    3332            733", "                                    5222            922", "                                    32222           4333", "                                                    5332", "                                                    7222", "                                                    33322", "                                                    52222", "                                                    322222"], "mathematica": ["Table[Length[Select[IntegerPartitions[n],!MemberQ[#,1]&&CoprimeQ@@Union[#]&]],{n,0,30}]"], "xref": ["A200976 is a pairwise non-coprime instead of pairwise coprime version.", "A304709 allows 1's, with strict case A305713 and Heinz numbers A304711.", "A318717 counts pairwise non-coprime strict partitions.", "A337485 is the strict version, with Heinz numbers A337984.", "A337987 gives the Heinz numbers of these partitions.", "A338317 considers singletons coprime, with Heinz numbers A338316.", "A007359 counts singleton or pairwise coprime partitions with no 1's.", "A327516 counts pairwise coprime partitions, ranked by A302696.", "A328673 counts partitions with no two distinct parts relatively prime.", "A337462 counts pairwise coprime compositions, ranked by A333227.", "A337561 counts pairwise coprime strict compositions.", "A337665 counts compositions whose distinct parts are pairwise coprime.", "A337667 counts pairwise non-coprime compositions, ranked by A337666.", "A337697 counts pairwise coprime compositions with no 1's.", "Cf. A051424, A101268, A220377, A302568, A328867, A333228, A337563."], "keyword": "nonn", "offset": "0,8", "author": "_Gus Wiseman_, Oct 23 2020", "references": 4, "revision": 14, "time": "2021-03-11T03:22:19-05:00", "created": "2020-10-24T16:39:01-04:00"}]}